----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Sanscubed/Desktop/Fall 21/Thesis/Assignments/Stata Assignment/StataAssignment.log
  log type:  text
 opened on:  20 Sep 2021, 20:00:24

.  use "/Users/Sanscubed/Desktop/Fall 21/Thesis/Assignments/Stata Assignment/census13.dta"
(1980 Census data by state)

. 
. save  census13, replace
file census13.dta saved

. browse 

. 
. *b. How many variables? 

. describe 

Contains data from census13.dta
  obs:            50                          1980 Census data by state
 vars:             9                          20 Sep 2021 20:00
----------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------
state           long    %13.0g     state1     State
brate           long    %10.0g                Birth rate
pop             long    %12.0gc               Population
medage          float   %9.2f                 Median age
division        int     %8.0g      division   Census Division
region          int     %-8.0g     cenreg     Census region
mrgrate         float   %9.0g                 Marriage rate
dvcrate         float   %9.0g                 Divorce rate
medagesq        float   %9.0g                 Median age squared
----------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. *c. summarize variables

. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       state |         50        25.5    14.57738          1         50
       brate |         50      167.94    29.34552        125        286
         pop |         50     4518149     4715038     401851   2.37e+07
      medage |         50       29.54    1.693445       24.2       34.7
    division |         50        5.12    2.560612          1          9
-------------+---------------------------------------------------------
      region |         50        2.66    1.061574          1          4
     mrgrate |         50    .0186789    .0257327   .0103731   .1955433
     dvcrate |         50    .0079769    .0031552   .0039954   .0236739
    medagesq |         50     875.422    99.87562     585.64    1204.09

. 
. *d. Tabulate the census divisions by region.

. tabulate region 

     Census |
     region |      Freq.     Percent        Cum.
------------+-----------------------------------
         NE |          9       18.00       18.00
    N Cntrl |         12       24.00       42.00
      South |         16       32.00       74.00
       West |         13       26.00      100.00
------------+-----------------------------------
      Total |         50      100.00

. 
. *e.Create a table of the mean birthrate, marriage rate, and divorce rate by division.

. tabstat brate mrgrate dvcrate, by(region) 

Summary statistics: mean
  by categories of: region (Census region)

 region |     brate   mrgrate   dvcrate
--------+------------------------------
     NE |  136.8889   .012054  .0057816
N Cntrl |    167.75  .0139124  .0065904
  South |  162.5625  .0161761  .0079325
   West |  196.2308  .0307456   .010831
--------+------------------------------
  Total |    167.94  .0186789  .0079769
---------------------------------------

. 
. * eii. Make table of marriage rate by state

. tabstat mrgrate region, by(state)

Summary statistics: mean
  by categories of: state (State)

        state |   mrgrate    region
--------------+--------------------
      Alabama |  .0179445         3
       Alaska |  .0197746         4
      Arizona |  .0156862         4
     Arkansas |  .0164161         3
   California |  .0122035         4
     Colorado |  .0167777         4
  Connecticut |  .0114013         1
     Delaware |  .0103731         3
      Florida |  .0146675         3
      Georgia |  .0185063         3
       Hawaii |  .0172049         4
        Idaho |  .0210711         4
     Illinois |  .0134201         2
      Indiana |  .0149417         2
         Iowa |  .0131585         2
       Kansas |  .0144911         2
     Kentucky |  .0126945         3
    Louisiana |  .0151143         3
        Maine |  .0149887         1
     Maryland |  .0151759         3
Massachusetts |  .0108964         1
     Michigan |  .0133482         2
    Minnesota |  .0129611         2
  Mississippi |  .0163545         3
     Missouri |  .0153691         2
      Montana |  .0150254         4
  N. Carolina |  .0110601         3
    N. Dakota |  .0131983         2
     Nebraska |  .0126833         2
       Nevada |  .1955433         4
New Hampshire |  .0139632         1
   New Jersey |  .0103823         1
   New Mexico |  .0188037         4
     New York |  .0112289         1
         Ohio |  .0129596         2
     Oklahoma |  .0214287         3
       Oregon |  .0120437         4
 Pennsylvania |   .010717         1
 Rhode Island |  .0106346         1
  S. Carolina |  .0247333         3
    S. Dakota |  .0181383         2
    Tennessee |  .0179723         3
        Texas |  .0183171         3
         Utah |   .018414         4
      Vermont |  .0142733         1
     Virginia |  .0155482         3
  W. Virginia |  .0125114         3
   Washington |  .0159476         4
    Wisconsin |  .0122795         2
      Wyoming |  .0211973         4
--------------+--------------------
        Total |  .0186789      2.66
-----------------------------------

. 
. tabstat brate mrgrate dvcrate, by(division) 

Summary statistics: mean
  by categories of: division (Census Division)

division |     brate   mrgrate   dvcrate
---------+------------------------------
 N. Eng. |  138.3333  .0126929  .0063419
 Mid Atl |       134  .0107761   .004661
  E.N.C. |       160  .0133898  .0072717
  W.N.C. |  173.2857  .0142857  .0061038
 S. Atl. |     151.5   .015322  .0070378
  E.S.C. |    166.75  .0162415  .0083921
  W.S.C. |     180.5   .017819  .0092623
Mountain |     203.5  .0403148   .011849
 Pacific |     184.6  .0154348  .0092022
---------+------------------------------
   Total |    167.94  .0186789  .0079769
----------------------------------------

. gen mar_to_div = mrgrate/dvcrate

. label variable mar_to_div "Ratio of Marriage Rate to Divorce Rate"

. histogram mar_to_div
(bin=7, start=1.2951244, width=.99496237)

. save  census13, replace
file census13.dta saved

. clear all 

. infile using wage_educ.dct 

<stata_dta><header><release>118</release><byteorder>LSF</byteorder><K>
file does not contain dictionary
r(613);

. 
. infile using "wage_educ.dct" 

<stata_dta><header><release>118</release><byteorder>LSF</byteorder><K>
file does not contain dictionary
r(613);

. cd "/Users/Sanscubed/Desktop/Fall 21/Thesis/Assignments/Stata Assignment"
/Users/Sanscubed/Desktop/Fall 21/Thesis/Assignments/Stata Assignment

. log using StataAssignment.log
log file already open
r(604);

. infile using "wage_educ.dct" 

<stata_dta><header><release>118</release><byteorder>LSF</byteorder><K>
file does not contain dictionary
r(613);

. use wage_educ

. rename  (R0000100 R0536300 R0536401 R0536402 R1235800 R1302400 R1302500 R1482600 T3600100 T3602100 T3731100 T4406000) (pubid gender bi
> rthdate1 birthdate2 sampletype father mother race release region highestdegree salary)
variable R0000100 not found
r(111);

. infile using "wage_educ.dct" 
you must start with an empty dataset
r(18);

. clear

. infile using wage_educ.dct

<stata_dta><header><release>118</release><byteorder>LSF</byteorder><K>
file does not contain dictionary
r(613);

. infile using wage_educ.dct

infile dictionary {
  R0000100 "PUBID - YTH ID CODE 1997"
  R0536300 "KEY!SEX (SYMBOL) 1997"
  R0536401 "KEY!BDATE M/Y (SYMBOL) 1997"
  R0536402 "KEY!BDATE M/Y (SYMBOL) 1997"
  R1235800 "CV_SAMPLE_TYPE 1997"
  R1302400 "CV_HGC_BIO_DAD 1997"
  R1302500 "CV_HGC_BIO_MOM 1997"
  R1482600 "KEY!RACE_ETHNICITY (SYMBOL) 1997"
  T3600100 "R13 RELEASE VERSION NUMBER 2009"
  T3602100 "CV_CENSUS_REGION 2009"
  T3731100 "HIGHEST DEGREE EVER RECEIVED 2009"
  T4406000 "TTL INC WAGES, SALARY PAST YR 2009"
}

(8,984 observations read)

. rename  (R0000100 R0536300 R0536401 R0536402 R1235800 R1302400 R1302500 R1482600 T3600100 T3602100 T3731100 T4406000) (pubid gender bi
> rthdate1 birthdate2 sampletype father mother race release region highestdegree salary)

. 
. * b.Create a variable named “year” and set it equal to the year before the 

. * respondents were surveyed about their income and education.

. gen year = 2008

. * c.How many respondents did not provide answers to the questions about their 

. * father’s and mother’s highest grades completed, respectively? (Hint: use the codebook)

. codebook 

----------------------------------------------------------------------------------------------------------------------------------------
pubid                                                                                                           PUBID - YTH ID CODE 1997
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9022]                     units:  1
         unique values:  8,984                    missing .:  0/8,984

                  mean:    4504.3
              std. dev:   2603.14

           percentiles:        10%       25%       50%       75%       90%
                               900    2248.5    4501.5    6758.5      8113

----------------------------------------------------------------------------------------------------------------------------------------
gender                                                                                                             KEY!SEX (SYMBOL) 1997
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,2]                        units:  1
         unique values:  2                        missing .:  0/8,984

            tabulation:  Freq.  Value
                         4,599  1
                         4,385  2

----------------------------------------------------------------------------------------------------------------------------------------
birthdate1                                                                                                   KEY!BDATE M/Y (SYMBOL) 1997
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,12]                       units:  1
         unique values:  12                       missing .:  0/8,984

                  mean:   6.55599
              std. dev:   3.46943

           percentiles:        10%       25%       50%       75%       90%
                                 2         3         7        10        11

----------------------------------------------------------------------------------------------------------------------------------------
birthdate2                                                                                                   KEY!BDATE M/Y (SYMBOL) 1997
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1980,1984]                  units:  1
         unique values:  5                        missing .:  0/8,984

            tabulation:  Freq.  Value
                         1,691  1980
                         1,874  1981
                         1,841  1982
                         1,807  1983
                         1,771  1984

----------------------------------------------------------------------------------------------------------------------------------------
sampletype                                                                                                           CV_SAMPLE_TYPE 1997
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/8,984

            tabulation:  Freq.  Value
                         2,236  0
                         6,748  1

----------------------------------------------------------------------------------------------------------------------------------------
father                                                                                                               CV_HGC_BIO_DAD 1997
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [-4,95]                      units:  1
         unique values:  23                       missing .:  0/8,984

                  mean:   9.34795
              std. dev:    7.5048

           percentiles:        10%       25%       50%       75%       90%
                                -3         6        12        14        16

----------------------------------------------------------------------------------------------------------------------------------------
mother                                                                                                               CV_HGC_BIO_MOM 1997
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [-4,95]                      units:  1
         unique values:  23                       missing .:  0/8,984

                  mean:   11.2926
              std. dev:   5.46923

           percentiles:        10%       25%       50%       75%       90%
                                 6        11        12        14        16

----------------------------------------------------------------------------------------------------------------------------------------
race                                                                                                    KEY!RACE_ETHNICITY (SYMBOL) 1997
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,4]                        units:  1
         unique values:  4                        missing .:  0/8,984

            tabulation:  Freq.  Value
                         2,335  1
                         1,901  2
                            83  3
                         4,665  4

----------------------------------------------------------------------------------------------------------------------------------------
release                                                                                                  R13 RELEASE VERSION NUMBER 2009
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [-5,378]                     units:  1
         unique values:  2                        missing .:  0/8,984

            tabulation:  Freq.  Value
                         1,423  -5
                         7,561  378

----------------------------------------------------------------------------------------------------------------------------------------
region                                                                                                             CV_CENSUS_REGION 2009
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [-5,4]                       units:  1
         unique values:  6                        missing .:  0/8,984

            tabulation:  Freq.  Value
                         1,423  -5
                            49  -4
                         1,160  1
                         1,576  2
                         3,063  3
                         1,713  4

----------------------------------------------------------------------------------------------------------------------------------------
highestdegree                                                                                          HIGHEST DEGREE EVER RECEIVED 2009
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [-5,8]                       units:  1
         unique values:  11                       missing .:  0/8,984

                  mean:   2.00334
              std. dev:   3.29678

           percentiles:        10%       25%       50%       75%       90%
                                -5         1         3         4         5

----------------------------------------------------------------------------------------------------------------------------------------
salary                                                                                                TTL INC WAGES, SALARY PAST YR 2009
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [-5,121993]                  units:  1
         unique values:  454                      missing .:  0/8,984

                  mean:     19100
              std. dev:     22538

           percentiles:        10%       25%       50%       75%       90%
                                -5        -4     13000     32000     47000

----------------------------------------------------------------------------------------------------------------------------------------
year                                                                                                                         (unlabeled)
----------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [2008,2008]                  units:  1
         unique values:  1                        missing .:  0/8,984

            tabulation:  Freq.  Value
                         8,984  2008

. * d.Create a table of the mean and standard deviation of income by highest degree

. * ever received. Which degree level has the largest variance in income? Does this make 

. * sense?

. tabstat salary, by(highestdegree) stat(mean sd)

Summary for variables: salary
     by categories of: highestdegree (HIGHEST DEGREE EVER RECEIVED 2009)

highestdegree |      mean        sd
--------------+--------------------
           -5 |        -5         0
           -2 |  31135.09  23820.31
           -1 |     10999  15557.76
            1 |  10235.63  14526.49
            2 |  13641.19  16254.22
            3 |  20686.47  20648.37
            4 |   26064.4  21851.36
            5 |  33404.89  25827.85
            6 |  36075.82  25378.49
            7 |     31118  24515.83
            8 |  43742.26  43659.81
--------------+--------------------
        Total |     19100  22538.01
-----------------------------------

. * e. Save the dataset as a stata dile

. save wage_educ, replace
file wage_educ.dta saved

. 
. clear

. import delimited "unemp_rate.csv"
(37 vars, 4 obs)

. 
. * a.Reshape the data so that it is long. Each row should contain a region-year observation of the unemployment rate.

. reshape long unemp_rate@, i(region) j(year)
(note: j = 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 
> 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        4   ->     144
Number of variables                  37   ->       3
j variable (36 values)                    ->   year
xij variables:
unemp_rate1976 unemp_rate1977 ... unemp_rate2011->unemp_rate
-----------------------------------------------------------------------------

. 
. * b.To merge these data with the dataset in question 2., you need a numeric variable that identifies the region in both datasets which
>  has the same name and is coded the same way. 

. * Using the NLSY97 codebook, rename (if required) and recode “region” so that it is coded the same way as the region variable you rena
> med in 2.a. in the NLSY97 (e.g. 1 = “Northeast”).

. encode region, gen(region2)

. drop region

. recode region2 (2 = 1 "Northeast")(1 = 2 "North Central")(3 = 3 "South")(4 = 4 "West"), gen(region) 
(72 differences between region2 and region)

. save unemp_rate, replace
file unemp_rate.dta saved

. * c.Merge the NLSY97 data from question 2. into the dataset on “region” and “year.” To check whether the merge did what you expect, ta
> bulate “_merge.”

. use unemp_rate.dta, clear

. save unemp_rate.dta, replace
file unemp_rate.dta saved

. use wage_educ.dta, clear

. merge m:1 region year using "unemp_rate.dta"
(note: variable region was float, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,612
        from master                     1,472  (_merge==1)
        from using                        140  (_merge==2)

    matched                             7,512  (_merge==3)
    -----------------------------------------

. 
. * i.What does 3 represent?

. tablulate _merged
command tablulate is unrecognized
r(199);

. * ii.What do 1 and 2 represent? Do the totals make sense? For the NLSY97 respondents for which “_merge” = 2, why?

. 
. * iii.Keep only the observations matched in both datasets.

. drop if _merge != 3
(1,612 observations deleted)

. * d.Create a table displaying the means of the unemployment rates and income by region.

. tabstat unemp_rate salary, by(region) 

Summary statistics: mean
  by categories of: region (CV_CENSUS_REGION 2009)

  region |  unemp_~e    salary
---------+--------------------
       1 |       5.4  23893.33
       2 |         6  22832.51
       3 |       5.5  20853.77
       4 |       6.3  25151.59
---------+--------------------
   Total |  5.771885  22718.32
------------------------------

. 
. clear all 

. capture log close 
